Chapter 1 - How a Data Scientist Beat the Odds
Chapter 2 - A Data Science Framework
Chapter 3 - Step 1: Define the Problem and Step 2: Gather the Data
Chapter 4 - Step 3: Prepare Data for Consumption
Chapter 5 - The 4 C's of Data Cleaning: Correcting, Completing, Creating, and Converting
Chapter 6 - Step 4: Perform Exploratory Analysis with Statistics
Chapter 7 - Step 5: Model Data
Chapter 8 - Evaluate Model Performance
Chapter 9 - Tune Model with Hyper-Parameters
Chapter 10 - Tune Model with Feature Selection
Chapter 11 - Step 6: Validate and Implement
Chapter 12 - Conclusion and Step 7: Optimize and Strategize
Change Log
Credits

In [70]:
import pandas as pd

In [71]:
train=pd.read_csv('data/train.csv')

In [72]:
test=pd.read_csv('data/test.csv')

In [73]:
data_cleaner=[train,test]

In [74]:
print(train.info())
train.sample(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
160,161,0,3,"Cribb, Mr. John Hatfield",male,44.0,0,1,371362,16.1000,NaN,S
333,334,0,3,"Vander Planke, Mr. Leo Edmondus",male,16.0,2,0,345764,18.0000,NaN,S
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
848,849,0,2,"Harper, Rev. John",male,28.0,0,1,248727,33.0000,NaN,S
213,214,0,2,"Givard, Mr. Hans Kristensen",male,30.0,0,0,250646,13.0000,NaN,S
73,74,0,3,"Chronopoulos, Mr. Apostolos",male,26.0,1,0,2680,14.4542,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
198,199,1,3,"Madigan, Miss. Margaret ""Maggie""",female,NaN,0,0,370370,7.7500,NaN,Q
563,564,0,3,"Simmons, Mr. John",male,NaN,0,0,SOTON/OQ 392082,8.0500,NaN,S
237,238,1,2,"Collyer, Miss. Marjorie ""Lottie""",female,8.0,0,2,C.A. 31921,26.2500,NaN,S

In [75]:
train.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Lefebre, Miss. Ida",male,NaN,NaN,NaN,CA. 2343,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [76]:
train_null=train.isnull().sum()
train_null[train_null>0].sort_values(ascending=False)

Cabin       687
Age         177
Embarked      2
dtype: int64

In [77]:
#Clean data

In [78]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [79]:
train=train.drop(['PassengerId'],axis=1)

In [80]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [81]:
train=train.drop(['Ticket','Cabin'],axis=1)

In [82]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [83]:
train=train.drop(['Name'],axis=1)

In [84]:
train['Embarked']=train.Embarked.fillna('S')

In [85]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [67]:
train.Embarked.value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [68]:
train[train['Embarked']=='S']=0
train[train['Embarked']=='C']=1
train[train['Embarked']=='Q']=2

In [44]:
train.Embarked.value_counts()

0    646
1    168
2     77
Name: Embarked, dtype: int64

   Survived  Pclass  Sex  Age  SibSp  Parch  Fare  Embarked
0         0       0    0  0.0      0      0   0.0         0
1         1       1    1  1.0      1      1   1.0         1
2         0       0    0  0.0      0      0   0.0         0
3         0       0    0  0.0      0      0   0.0         0
4         0       0    0  0.0      0      0   0.0         0

In [46]:
train['Family']=train['SibSp']+train['Parch']

In [47]:
train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Fare  Embarked  Family
0         0       0    0  0.0      0      0   0.0         0       0
1         1       1    1  1.0      1      1   1.0         1       2
2         0       0    0  0.0      0      0   0.0         0       0
3         0       0    0  0.0      0      0   0.0         0       0
4         0       0    0  0.0      0      0   0.0         0       0

In [48]:
train[train['Family']>=1]=1

In [49]:
train.sample(20)

     Survived  Pclass  Sex  Age  SibSp  Parch  Fare  Embarked  Family
353         0       0    0  0.0      0      0   0.0         0       0
135         1       1    1  1.0      1      1   1.0         1       1
427         0       0    0  0.0      0      0   0.0         0       0
2           0       0    0  0.0      0      0   0.0         0       0
226         0       0    0  0.0      0      0   0.0         0       0
181         1       1    1  1.0      1      1   1.0         1       1
90          0       0    0  0.0      0      0   0.0         0       0
430         0       0    0  0.0      0      0   0.0         0       0
185         0       0    0  0.0      0      0   0.0         0       0
21          0       0    0  0.0      0      0   0.0         0       0
321         0       0    0  0.0      0      0   0.0         0       0
571         0       0    0  0.0      0      0   0.0         0       0
329         1       1    1  1.0      1      1   1.0         1       1
385         0       0    0  0.0      0      0   0.0         0       0
291         1       1    1  1.0      1      1   1.0         1       1
18          0       0    0  0.0      0      0   0.0         0       0
746         0       0    0  0.0      0      0   0.0         0       0
736         0       0    0  0.0      0      0   0.0         0       0
447         0       0    0  0.0      0      0   0.0         0       0
236         0       0    0  0.0      0      0   0.0         0       0

In [50]:
train=train.drop(['SibSp','Parch'],axis=1)

In [51]:
train.head()

   Survived  Pclass  Sex  Age  Fare  Embarked  Family
0         0       0    0  0.0   0.0         0       0
1         1       1    1  1.0   1.0         1       1
2         0       0    0  0.0   0.0         0       0
3         0       0    0  0.0   0.0         0       0
4         0       0    0  0.0   0.0         0       0